src/InformationRegisters/ЖурналСобытийОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЖурналСобытийОборудования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ГруппаТоваров</Name>
					<Comment>Группа товаров оборудования</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыТоваровОборудования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Оборудование</Name>
					<Comment>Оборудование</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючевыеОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСеанса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЖурналСобытийОборудования/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьИмяФайлаОборудования(КаталогАрхива, Оборудование, Событие)
	
	Если ПустаяСтрока(КаталогАрхива) Тогда
		Возврат "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Оборудование) Тогда
		
		НаименованиеОборудования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Оборудование, "Наименование");
		ПолныйПуть = КаталогАрхива + "\" + НаименованиеОборудования+"\";
		
	Иначе
		
		ПолныйПуть = КаталогАрхива + "\Общий\";
		
	КонецЕсли;
	
	Файл = Новый Файл(ПолныйПуть);
	Если НЕ Файл.Существует() Тогда
		СоздатьКаталог(ПолныйПуть);
	КонецЕсли;
	
	Результат = ПолныйПуть+Формат(ТекущаяДатаСеанса(), "ДФ=yyyy_MM_dd_hh_mm_ss")+"_"+Строка(Событие);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗафиксироватьСобытие(ГруппаТоваров, Оборудование, Событие, Комментарий, ДанныеСобытия) Экспорт
	
	ДанныеГруппыТоваров = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ГруппаТоваров, "ФиксироватьСобытия, КаталогАрхива");
	
	Если НЕ ДанныеГруппыТоваров.ФиксироватьСобытия Тогда
		Возврат;
	КонецЕсли;
	
	СобытиеСсылка = ОценкаПроизводительностиПовтИсп.ПолучитьКлючевуюОперациюПоИмени(Событие);
	
	ИмяФайлаСобытия = ПолучитьИмяФайлаОборудования(ДанныеГруппыТоваров.КаталогАрхива, Оборудование, Событие);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, ДанныеСобытия, НазначениеТипаXML.Явное);
	ТекстЛога = ЗаписьJSON.Закрыть();
	
	Если Не ПустаяСтрока(ИмяФайлаСобытия) Тогда
		ФайлЛога = Новый ТекстовыйДокумент();
		ФайлЛога.УстановитьТекст(ТекстЛога);
		Попытка
			ФайлЛога.Записать(ИмяФайлаСобытия+".txt", КодировкаТекста.UTF8);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Запись = РегистрыСведений.ЖурналСобытийОборудования.СоздатьМенеджерЗаписи();
	Запись.ГруппаТоваров = ГруппаТоваров;
	Запись.Оборудование  = Оборудование;
	Запись.Событие       = СобытиеСсылка;
	Запись.ИмяФайла      = ИмяФайлаСобытия;
	Запись.Комментарий   = Комментарий;
	Запись.ДатаСобытия   = ТекущаяДатаСеанса();
	Запись.НомерСеанса   = НомерСеансаИнформационнойБазы();
	Запись.Пользователь  = ПользователиИнформационнойБазы.ТекущийПользователь();
	Запись.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецЕсли
